# Paquetería de Pandas. 
### Series

Una serie es el primer tipo de datos de pandas y es muy similar a una matriz NumPy (de hecho está construida sobre el objeto de matriz NumPy). Lo que diferencia un arreglo NumPy de una serie, es que una serie puede tener etiquetas en los ejes, lo que significa que puede ser indexada por una etiqueta, en lugar de solo una ubicación numérica. Tampoco necesita contener datos numéricos, puede contener cualquier Objeto de Python arbitrario.

### Valores núlos

Para poder tener valores núlos en series de pandas se puede utilizar la librería de numpy llamada np.nan. Esta librería permite tener valores núlos en series de pandas.

In [56]:
import numpy as np
import pandas as pd
a = pd.Series([1,np.nan,3,np.nan,5,6])
print(a)

0    1.0
1    NaN
2    3.0
3    NaN
4    5.0
5    6.0
dtype: float64

### Dataframes

Es una estructura de datos similar a las tablas de datos de excel, y al igual que esas son conformadas ppor columnas y filas. Los dataframes son una estructura de datos muy poderosa y flexible, y es una de las razones por las que pandas es tan popular (junto con la capacidad de trabajar con datos faltantes).

In [57]:
usuarios = {
    'username' : ['admin','user1','user2','user3','user4'],
    'password' : ['1234','2341','3412','4123','4321'],
    'email' : ['admin@example.com','user1@example.com','user2@example.com','user3@example.com','user4@example.com'],
    'age' : [20,21,22,23,24],
    'status' : [True,False,True,False,True]
}
data = pd.DataFrame(usuarios,index=['1','2','3','4','5'])

Para conocer todos los valores de una columna en especifico se puede utilizar el comando .unique().

In [58]:
data['username']

1    admin
2    user1
3    user2
4    user3
5    user4
Name: username, dtype: object

In [59]:
data['email'][2]

'user2@example.com'

Otra forma de conocer los valores de una sola columna es através de los atributos.

In [60]:
data.username

1    admin
2    user1
3    user2
4    user3
5    user4
Name: username, dtype: object

In [61]:
data.email

1    admin@example.com
2    user1@example.com
3    user2@example.com
4    user3@example.com
5    user4@example.com
Name: email, dtype: object

Para conocer todas las columnas de un DataFrame podemos utilizar el método columns

In [62]:
data.columns

Index(['username', 'password', 'email', 'age', 'status'], dtype='object')

Para conocer los valores del DataFrame podemos utilizar el método values

In [63]:
data.values

array([['admin', '1234', 'admin@example.com', 20, True],
       ['user1', '2341', 'user1@example.com', 21, False],
       ['user2', '3412', 'user2@example.com', 22, True],
       ['user3', '4123', 'user3@example.com', 23, False],
       ['user4', '4321', 'user4@example.com', 24, True]], dtype=object)

Para añadir nuevas columnas al dataframe debemos crear primero otras series y después añadirlas al dataframe.

In [64]:
calificaciones = pd.Series(np.random.randint(6,10,5),index=['1','2','3','4','5'])

In [65]:
data['calificaciones'] = calificaciones
data

  username password              email  age  status  calificaciones
1    admin     1234  admin@example.com   20    True               8
2    user1     2341  user1@example.com   21   False               9
3    user2     3412  user2@example.com   22    True               6
4    user3     4123  user3@example.com   23   False               6
5    user4     4321  user4@example.com   24    True               6

Para renombrar las columnas de un dataframe podemos utilizar el método rename.

In [66]:
data = data.rename(
    columns={'calificaciones':'score'},
)

Para eliminar columnas de un dataframe podemos utilizar  ```del```

In [67]:
del data['score']

In [68]:
data

  username password              email  age  status
1    admin     1234  admin@example.com   20    True
2    user1     2341  user1@example.com   21   False
3    user2     3412  user2@example.com   22    True
4    user3     4123  user3@example.com   23   False
5    user4     4321  user4@example.com   24    True